[Killed] BlockStatement
src/controllers/salesController.js:4:37
 const { salesService } = require('../services');
 const mapStatusHTTP = require('../utils/mapStatusHTTP');
 
-const getAll = async (_req, res) => {
-  const { status, data } = await salesService.getAll();
-  return res.status(mapStatusHTTP(status)).json(data);
-};
+const getAll = async (_req, res) => {};
 
 const getById = async (req, res) => {
killedBy: Testa Controller de sales retorna sales com sucesso - status 200
statusReason: expected stub to have been called with arguments 200

[Killed] BlockStatement
src/controllers/salesController.js:9:37
   return res.status(mapStatusHTTP(status)).json(data);
 };
 
-const getById = async (req, res) => {
-  const { id } = req.params;
-  const { status, data } = await salesService.getById(id);
-  return res.status(mapStatusHTTP(status)).json(data);
-};
+const getById = async (req, res) => {};
 
 const insert = async (req, res) => {
killedBy: Testa Controller de sales retorna um sale específico com sucesso - status 200
statusReason: expected stub to have been called with arguments 200

[Killed] BlockStatement
src/controllers/salesController.js:15:36
   return res.status(mapStatusHTTP(status)).json(data);
 };
 
-const insert = async (req, res) => {
-  const sales = req.body;
-  const { status, data } = await salesService.insert(sales);
-  return res.status(mapStatusHTTP(status)).json(data);
-};
+const insert = async (req, res) => {};
 
 const deleteId = async (req, res) => {
killedBy: Testa Controller de sales cria uma sale com vários produtos - status 201
statusReason: expected stub to have been called with arguments 201

[Killed] BlockStatement
src/controllers/salesController.js:21:38
   return res.status(mapStatusHTTP(status)).json(data);
 };
 
-const deleteId = async (req, res) => {
-  const { id } = req.params;
-  const { status, data } = await salesService.deleteId(id);
-  return res.status(mapStatusHTTP(status)).json(data);
-};
+const deleteId = async (req, res) => {};
 
 const updateQuantity = async (req, res) => {
killedBy: Testa Controller de sales remove uma sale com sucesso - status 204
statusReason: expected stub to have been called with arguments 204

[NoCoverage] BlockStatement
src/controllers/salesController.js:27:44
   return res.status(mapStatusHTTP(status)).json(data);
 };
 
-const updateQuantity = async (req, res) => {
-  const { saleId, productId } = req.params;
-  const { quantity } = req.body;
-  const { status, data } = await salesService.updateQuantity(saleId, productId, quantity);
-  return res.status(mapStatusHTTP(status)).json(data);
-};
+const updateQuantity = async (req, res) => {};
 
 module.exports = {
