[Killed] BlockStatement
src/models/salesModel.js:4:28
 // const snakeize = require('snakeize');
 const connection = require('../database/connection');
 
-const getAll = async () => {
-  const [sales] = await connection.execute(`SELECT
-    sales.id AS saleId,
-    sales.date, sales_products.product_id AS productId, sales_products.quantity
-    FROM StoreManager.sales
-    INNER JOIN StoreManager.sales_products ON sales.id = sales_products.sale_id
-    ORDER BY saleId ASC, productId ASC
-  `);
-  return sales;
-};
+const getAll = async () => {};
 
 const getById = async (id) => {
killedBy: Testa Model de sales retorna a lista de sales
statusReason: expected undefined to be an array

[Killed] BlockStatement
src/models/salesModel.js:15:31
   return sales;
 };
 
-const getById = async (id) => {
-  const [sale] = await connection.execute(`SELECT
-    sales.date, sales_products.product_id AS productId, sales_products.quantity
-    FROM StoreManager.sales
-    INNER JOIN StoreManager.sales_products ON sales.id = sales_products.sale_id
-    WHERE sales.id = ?
-    ORDER BY productid ASC`, [id]);
-  if (!sale) return null;
-  return sale;
-};
+const getById = async (id) => {};
 
 const insert = async () => {
killedBy: Testa Model de sales retorna um sale específico
statusReason: expected undefined to be an object

[Killed] ConditionalExpression
src/models/salesModel.js:22:7
     INNER JOIN StoreManager.sales_products ON sales.id = sales_products.sale_id
     WHERE sales.id = ?
     ORDER BY productid ASC`, [id]);
-  if (!sale) return null;
+  if (false) return null;
   return sale;
 };
killedBy: Testa Model de sales não é possível listar uma venda que não existe
statusReason: expected undefined to equal null

[Killed] ConditionalExpression
src/models/salesModel.js:22:7
     INNER JOIN StoreManager.sales_products ON sales.id = sales_products.sale_id
     WHERE sales.id = ?
     ORDER BY productid ASC`, [id]);
-  if (!sale) return null;
+  if (true) return null;
   return sale;
 };
killedBy: Testa Model de sales retorna um sale específico
statusReason: expected null to be an object

[Killed] BlockStatement
src/models/salesModel.js:26:28
   return sale;
 };
 
-const insert = async () => {
-  const [{ insertId }] = await connection.execute(
-    'INSERT INTO StoreManager.sales (date) VALUES (CURRENT_TIMESTAMP)',
-  );
-  return insertId;
-};
+const insert = async () => {};
 
 const insertProducts = async (salesProducts) => {
killedBy: Testa Model de sales cria o sale product id
statusReason: expected undefined to be a number

[NoCoverage] BlockStatement
src/models/salesModel.js:33:49
   return insertId;
 };
 
-const insertProducts = async (salesProducts) => {
-  const { saleId, productId, quantity } = salesProducts;
-  await connection.execute(
-    'INSERT INTO StoreManager.sales_products (sale_id, product_id, quantity) VALUES (?, ?, ?)',
-    [saleId, productId, quantity],
-  );
-  return { productId, quantity };
-};
+const insertProducts = async (salesProducts) => {};
 
 const deleteId = async (id) => {

[Killed] BlockStatement
src/models/salesModel.js:42:32
   return { productId, quantity };
 };
 
-const deleteId = async (id) => {
-  const [remove] = await connection.execute('DELETE FROM StoreManager.sales WHERE id = ?', [id]);
-  return remove;
-};
+const deleteId = async (id) => {};
 
 const updateQuantity = async (saleId, productId, quantity) => {
killedBy: Testa Model de sales remove um sale
statusReason: expected undefined to be an object

[NoCoverage] BlockStatement
src/models/salesModel.js:47:63
   return remove;
 };
 
-const updateQuantity = async (saleId, productId, quantity) => {
-  const [update] = await connection.execute(
-    'UPDATE StoreManager.sales_products SET quantity = ? WHERE sale_id = ? AND product_id = ?',
-    [quantity, saleId, productId],
-  );
-  return update;
-};
+const updateQuantity = async (saleId, productId, quantity) => {};
 
 module.exports = {
