[Killed] BlockStatement
src/services/productsService.js:3:28
 const { productsModel } = require('../models');
 
-const getAll = async () => {
-  const products = await productsModel.getAll();
-  return { status: 'SUCCESSFUL', data: products };
-};
+const getAll = async () => {};
 
 const getById = async (id) => {
killedBy: Testa Service de produtos retorna produtos com sucesso
statusReason: Cannot read properties of undefined (reading 'status')

[NoCoverage] BlockStatement
src/services/productsService.js:8:31
   return { status: 'SUCCESSFUL', data: products };
 };
 
-const getById = async (id) => {
-  const product = await productsModel.getById(id);
-  if (!product) return { status: 'NOT_FOUND', data: { message: 'Product not found' } };
-  return { status: 'SUCCESSFUL', data: product };
-};
+const getById = async (id) => {};
 
 const insert = async (name) => {

[NoCoverage] ConditionalExpression
src/services/productsService.js:10:7
 
 const getById = async (id) => {
   const product = await productsModel.getById(id);
-  if (!product) return { status: 'NOT_FOUND', data: { message: 'Product not found' } };
+  if (true) return { status: 'NOT_FOUND', data: { message: 'Product not found' } };
   return { status: 'SUCCESSFUL', data: product };
 };

[NoCoverage] BooleanLiteral
src/services/productsService.js:10:7
 
 const getById = async (id) => {
   const product = await productsModel.getById(id);
-  if (!product) return { status: 'NOT_FOUND', data: { message: 'Product not found' } };
+  if (product) return { status: 'NOT_FOUND', data: { message: 'Product not found' } };
   return { status: 'SUCCESSFUL', data: product };
 };

[Killed] BlockStatement
src/services/productsService.js:14:32
   return { status: 'SUCCESSFUL', data: product };
 };
 
-const insert = async (name) => {
-  const productId = await productsModel.insert(name);
-  if (!productId) return { status: 'NOT_FOUND', data: { message: 'Error' } };
-  const newProduct = await productsModel.getById(productId);
-  return { status: 'CREATED', data: newProduct };
-};
+const insert = async (name) => {};
 
 const put = async (id, name) => {
killedBy: Testa Service de produtos insere um produto específico com sucesso
statusReason: Cannot read properties of undefined (reading 'status')

[Killed] BooleanLiteral
src/services/productsService.js:16:7
 
 const insert = async (name) => {
   const productId = await productsModel.insert(name);
-  if (!productId) return { status: 'NOT_FOUND', data: { message: 'Error' } };
+  if (productId) return { status: 'NOT_FOUND', data: { message: 'Error' } };
   const newProduct = await productsModel.getById(productId);
   return { status: 'CREATED', data: newProduct };
killedBy: Testa Service de produtos insere um produto específico com sucesso
statusReason: expected 'NOT_FOUND' to equal 'CREATED'

[Killed] ConditionalExpression
src/services/productsService.js:16:7
 
 const insert = async (name) => {
   const productId = await productsModel.insert(name);
-  if (!productId) return { status: 'NOT_FOUND', data: { message: 'Error' } };
+  if (true) return { status: 'NOT_FOUND', data: { message: 'Error' } };
   const newProduct = await productsModel.getById(productId);
   return { status: 'CREATED', data: newProduct };
killedBy: Testa Service de produtos insere um produto específico com sucesso
statusReason: expected 'NOT_FOUND' to equal 'CREATED'

[Killed] BlockStatement
src/services/productsService.js:21:33
   return { status: 'CREATED', data: newProduct };
 };
 
-const put = async (id, name) => {
-  const product = await productsModel.getById(id);
-  if (!product) return { status: 'NOT_FOUND', data: { message: 'Product not found' } };
-  await productsModel.put(id, name);
-  const newProduct = await productsModel.getById(id);
-  return { status: 'SUCCESSFUL', data: newProduct };
-};
+const put = async (id, name) => {};
 
 const deleteId = async (id) => {
killedBy: Testa Service de produtos atualiza um produto com sucesso
statusReason: Cannot read properties of undefined (reading 'status')

[Killed] BlockStatement
src/services/productsService.js:29:32
   return { status: 'SUCCESSFUL', data: newProduct };
 };
 
-const deleteId = async (id) => {
-  const product = await productsModel.getById(id);
-  if (!product) return { status: 'NOT_FOUND', data: { message: 'Product not found' } };
-  await productsModel.deleteId(id);
-  return { status: 'NO_CONTENT', data: {} };
-};
+const deleteId = async (id) => {};
 
 module.exports = {
killedBy: Testa Service de produtos testa se ocorre um erro ao deletar um produto
statusReason: Cannot read properties of undefined (reading 'status')
