[Killed] BlockStatement
src/services/salesService.js:4:28
 const { salesModel } = require('../models');
 const schema = require('./validations/validations');
 
-const getAll = async () => {
-  const sales = await salesModel.getAll();
-  return { status: 'SUCCESSFUL', data: sales };
-};
+const getAll = async () => {};
 
 const getById = async (id) => {
killedBy: Testa Service de sales retorna sales com sucesso
statusReason: Cannot read properties of undefined (reading 'status')

[NoCoverage] BlockStatement
src/services/salesService.js:9:31
   return { status: 'SUCCESSFUL', data: sales };
 };
 
-const getById = async (id) => {
-  const sale = await salesModel.getById(id);
-  if (sale.length > 0) return { status: 'SUCCESSFUL', data: sale };
-  return { status: 'NOT_FOUND', data: { message: 'Sale not found' } };
-};
+const getById = async (id) => {};
 
 const insert = async (salesProducts) => {

[NoCoverage] ConditionalExpression
src/services/salesService.js:11:7
 
 const getById = async (id) => {
   const sale = await salesModel.getById(id);
-  if (sale.length > 0) return { status: 'SUCCESSFUL', data: sale };
+  if (false) return { status: 'SUCCESSFUL', data: sale };
   return { status: 'NOT_FOUND', data: { message: 'Sale not found' } };
 };

[NoCoverage] EqualityOperator
src/services/salesService.js:11:7
 
 const getById = async (id) => {
   const sale = await salesModel.getById(id);
-  if (sale.length > 0) return { status: 'SUCCESSFUL', data: sale };
+  if (sale.length >= 0) return { status: 'SUCCESSFUL', data: sale };
   return { status: 'NOT_FOUND', data: { message: 'Sale not found' } };
 };

[NoCoverage] BlockStatement
src/services/salesService.js:15:41
   return { status: 'NOT_FOUND', data: { message: 'Sale not found' } };
 };
 
-const insert = async (salesProducts) => {
-  const error = await schema.validation(salesProducts);
-  if (error) return { status: error.type, data: { message: error.message } };
-  const saleId = await salesModel.insert();
-  const products = await Promise.all(salesProducts.map(({ productId, quantity }) => (
-    salesModel.insertProducts({ saleId, productId, quantity }))));
-  if (!products) return { status: 'NOT_FOUND', data: { message: 'Product not found' } };
-  return { status: 'CREATED', data: { id: saleId, itemsSold: products } };
-};
+const insert = async (salesProducts) => {};
 
 const deleteId = async (id) => {

[NoCoverage] ConditionalExpression
src/services/salesService.js:17:7
 
 const insert = async (salesProducts) => {
   const error = await schema.validation(salesProducts);
-  if (error) return { status: error.type, data: { message: error.message } };
+  if (false) return { status: error.type, data: { message: error.message } };
   const saleId = await salesModel.insert();
   const products = await Promise.all(salesProducts.map(({ productId, quantity }) => (

[NoCoverage] ConditionalExpression
src/services/salesService.js:17:7
 
 const insert = async (salesProducts) => {
   const error = await schema.validation(salesProducts);
-  if (error) return { status: error.type, data: { message: error.message } };
+  if (true) return { status: error.type, data: { message: error.message } };
   const saleId = await salesModel.insert();
   const products = await Promise.all(salesProducts.map(({ productId, quantity }) => (

[NoCoverage] ConditionalExpression
src/services/salesService.js:21:7
   const saleId = await salesModel.insert();
   const products = await Promise.all(salesProducts.map(({ productId, quantity }) => (
     salesModel.insertProducts({ saleId, productId, quantity }))));
-  if (!products) return { status: 'NOT_FOUND', data: { message: 'Product not found' } };
+  if (false) return { status: 'NOT_FOUND', data: { message: 'Product not found' } };
   return { status: 'CREATED', data: { id: saleId, itemsSold: products } };
 };

[NoCoverage] ConditionalExpression
src/services/salesService.js:21:7
   const saleId = await salesModel.insert();
   const products = await Promise.all(salesProducts.map(({ productId, quantity }) => (
     salesModel.insertProducts({ saleId, productId, quantity }))));
-  if (!products) return { status: 'NOT_FOUND', data: { message: 'Product not found' } };
+  if (true) return { status: 'NOT_FOUND', data: { message: 'Product not found' } };
   return { status: 'CREATED', data: { id: saleId, itemsSold: products } };
 };

[Killed] BlockStatement
src/services/salesService.js:25:32
   return { status: 'CREATED', data: { id: saleId, itemsSold: products } };
 };
 
-const deleteId = async (id) => {
-  const sale = await salesModel.getById(id);
-  if (sale.length > 0) {
-    await salesModel.deleteId(id);
-    return { status: 'NO_CONTENT', data: {} };
-  }
-  return { status: 'NOT_FOUND', data: { message: 'Sale not found' } };
-};
+const deleteId = async (id) => {};
 
 // const updateQuantity = async (saleId, productId, quantity) => {
killedBy: Testa Service de sales remove uma sale com sucesso
statusReason: Cannot read properties of undefined (reading 'status')

[Killed] EqualityOperator
src/services/salesService.js:27:7
 
 const deleteId = async (id) => {
   const sale = await salesModel.getById(id);
-  if (sale.length > 0) {
+  if (sale.length <= 0) {
     await salesModel.deleteId(id);
     return { status: 'NO_CONTENT', data: {} };
killedBy: Testa Service de sales remove uma sale com sucesso
statusReason: expected 'NOT_FOUND' to equal 'NO_CONTENT'

[Killed] ConditionalExpression
src/services/salesService.js:27:7
 
 const deleteId = async (id) => {
   const sale = await salesModel.getById(id);
-  if (sale.length > 0) {
+  if (false) {
     await salesModel.deleteId(id);
     return { status: 'NO_CONTENT', data: {} };
killedBy: Testa Service de sales remove uma sale com sucesso
statusReason: expected 'NOT_FOUND' to equal 'NO_CONTENT'

[Killed] BlockStatement
src/services/salesService.js:48:63
 //   return { status: 'SUCCESSFUL', data: updatedSale };
 // };
 
-const updateQuantity = async (saleId, productId, quantity) => {
-  const sale = await salesModel.getById(saleId);
-  if (sale.length > 0) {
-    const saleProduct = await salesModel.getById(productId);
-    if (saleProduct.length > 0) {
-      await salesModel.updateQuantity(saleId, productId, quantity);
-      const { date } = sale[0];
-      return { status: 'SUCCESSFUL',
-        data: { date, productId: +productId, quantity: +quantity, saleId: +saleId } };
-    }
-    return { status: 'NOT_FOUND', data: { message: 'Product not found in sale' } };
-  }
-  return { status: 'NOT_FOUND', data: { message: 'Sale not found' } };
-};
+const updateQuantity = async (saleId, productId, quantity) => {};
 
 module.exports = {
killedBy: Testa Service de sales deve retornar sucesso ao atualizar a quantidade
statusReason: expected undefined to deeply equal { Object (status, data) }

[Killed] ConditionalExpression
src/services/salesService.js:50:7
 
 const updateQuantity = async (saleId, productId, quantity) => {
   const sale = await salesModel.getById(saleId);
-  if (sale.length > 0) {
+  if (true) {
     const saleProduct = await salesModel.getById(productId);
     if (saleProduct.length > 0) {
killedBy: Testa Service de sales deve retornar not found ao atualizar a quantidade com sale não encontrada
statusReason: expected { Object (status, data) } to deeply equal { Object (status, data) }

[Killed] EqualityOperator
src/services/salesService.js:50:7
 
 const updateQuantity = async (saleId, productId, quantity) => {
   const sale = await salesModel.getById(saleId);
-  if (sale.length > 0) {
+  if (sale.length <= 0) {
     const saleProduct = await salesModel.getById(productId);
     if (saleProduct.length > 0) {
killedBy: Testa Service de sales deve retornar sucesso ao atualizar a quantidade
statusReason: expected { Object (status, data) } to deeply equal { Object (status, data) }

[Killed] ConditionalExpression
src/services/salesService.js:52:9
   const sale = await salesModel.getById(saleId);
   if (sale.length > 0) {
     const saleProduct = await salesModel.getById(productId);
-    if (saleProduct.length > 0) {
+    if (false) {
       await salesModel.updateQuantity(saleId, productId, quantity);
       const { date } = sale[0];
killedBy: Testa Service de sales deve retornar sucesso ao atualizar a quantidade
statusReason: expected { Object (status, data) } to deeply equal { Object (status, data) }

[Killed] BlockStatement
src/services/salesService.js:52:33
   const sale = await salesModel.getById(saleId);
   if (sale.length > 0) {
     const saleProduct = await salesModel.getById(productId);
-    if (saleProduct.length > 0) {
-      await salesModel.updateQuantity(saleId, productId, quantity);
-      const { date } = sale[0];
-      return { status: 'SUCCESSFUL',
-        data: { date, productId: +productId, quantity: +quantity, saleId: +saleId } };
-    }
+    if (saleProduct.length > 0) {}
     return { status: 'NOT_FOUND', data: { message: 'Product not found in sale' } };
   }
killedBy: Testa Service de sales deve retornar sucesso ao atualizar a quantidade
statusReason: expected { Object (status, data) } to deeply equal { Object (status, data) }

[Killed] UnaryOperator
src/services/salesService.js:56:34
       await salesModel.updateQuantity(saleId, productId, quantity);
       const { date } = sale[0];
       return { status: 'SUCCESSFUL',
-        data: { date, productId: +productId, quantity: +quantity, saleId: +saleId } };
+        data: { date, productId: -productId, quantity: +quantity, saleId: +saleId } };
     }
     return { status: 'NOT_FOUND', data: { message: 'Product not found in sale' } };
killedBy: Testa Service de sales deve retornar sucesso ao atualizar a quantidade
statusReason: expected { Object (status, data) } to deeply equal { Object (status, data) }

[Killed] UnaryOperator
src/services/salesService.js:56:75
       await salesModel.updateQuantity(saleId, productId, quantity);
       const { date } = sale[0];
       return { status: 'SUCCESSFUL',
-        data: { date, productId: +productId, quantity: +quantity, saleId: +saleId } };
+        data: { date, productId: +productId, quantity: +quantity, saleId: -saleId } };
     }
     return { status: 'NOT_FOUND', data: { message: 'Product not found in sale' } };
killedBy: Testa Service de sales deve retornar sucesso ao atualizar a quantidade
statusReason: expected { Object (status, data) } to deeply equal { Object (status, data) }
