[Killed] BlockStatement
src/controllers/productsController.js:4:37
 const { productsService } = require('../services');
 const mapStatusHTTP = require('../utils/mapStatusHTTP');
 
-const getAll = async (_req, res) => {
-  const { status, data } = await productsService.getAll();
-  return res.status(mapStatusHTTP(status)).json(data);
-};
+const getAll = async (_req, res) => {};
 
 const getById = async (req, res) => {
killedBy: Testa Controller de produtos retorna produtos com sucesso - status 200
statusReason: expected stub to have been called with arguments 200

[Killed] BlockStatement
src/controllers/productsController.js:9:37
   return res.status(mapStatusHTTP(status)).json(data);
 };
 
-const getById = async (req, res) => {
-  const { id } = req.params;
-  const { status, data } = await productsService.getById(id);
-  return res.status(mapStatusHTTP(status)).json(data);
-};
+const getById = async (req, res) => {};
 
 const insert = async (req, res) => {
killedBy: Testa Controller de produtos retorna um produto específico com sucesso - status 200
statusReason: expected stub to have been called with arguments 200

[Killed] BlockStatement
src/controllers/productsController.js:15:36
   return res.status(mapStatusHTTP(status)).json(data);
 };
 
-const insert = async (req, res) => {
-  const { name } = req.body;
-  const { status, data } = await productsService.insert(name);
-  return res.status(mapStatusHTTP(status)).json(data);
-};
+const insert = async (req, res) => {};
 
 const put = async (req, res) => {
killedBy: Testa Controller de produtos Inserindo um produto com id com sucesso - status 201
statusReason: expected stub to have been called with arguments 201

[Killed] BlockStatement
src/controllers/productsController.js:21:33
   return res.status(mapStatusHTTP(status)).json(data);
 };
 
-const put = async (req, res) => {
-  const { id } = req.params;
-  const { name } = req.body;
-  const { status, data } = await productsService.put(id, name);
-  return res.status(mapStatusHTTP(status)).json(data);
-};
+const put = async (req, res) => {};
 
 const deleteId = async (req, res) => {
killedBy: Testa Controller de produtos atualizando um produto com sucesso - status 200
statusReason: expected stub to have been called with arguments 200

[Killed] BlockStatement
src/controllers/productsController.js:28:38
   return res.status(mapStatusHTTP(status)).json(data);
 };
 
-const deleteId = async (req, res) => {
-  const { id } = req.params;
-  const { status, data } = await productsService.deleteId(id);
-  return res.status(mapStatusHTTP(status)).json(data);
-};
+const deleteId = async (req, res) => {};
 
 module.exports = {
killedBy: Testa Controller de produtos deletando um produto com sucesso - status 200
statusReason: expected stub to have been called with arguments 200
