[Killed] BlockStatement
src/middlewares/validateProduct.js:1:51
-const validateProduct = async (req, res, next) => {
-  const { name } = req.body;
-  if (!name || name === null) {
-    return res.status(400).json({ message: '"name" is required' });
-  }
-  if (name.length < 5) {
-    return res.status(422).json({ message: '"name" length must be at least 5 characters long' });
-  } 
-  return next();
-};
+const validateProduct = async (req, res, next) => {};
 
 module.exports = validateProduct;
killedBy: testa middlewares verifica se o middleware está sendo chamado
statusReason: expected stub to have been called with arguments

[Killed] BooleanLiteral
src/middlewares/validateProduct.js:3:7
 const validateProduct = async (req, res, next) => {
   const { name } = req.body;
-  if (!name || name === null) {
+  if (name || name === null) {
     return res.status(400).json({ message: '"name" is required' });
   }
killedBy: testa middlewares verifica se o middleware está sendo chamado
statusReason: res.status is not a function

[Killed] BlockStatement
src/middlewares/validateProduct.js:3:31
 const validateProduct = async (req, res, next) => {
   const { name } = req.body;
-  if (!name || name === null) {
-    return res.status(400).json({ message: '"name" is required' });
-  }
+  if (!name || name === null) {}
   if (name.length < 5) {
     return res.status(422).json({ message: '"name" length must be at least 5 characters long' });
killedBy: testa middlewares testa o validateProduct caso o nome seja null
statusReason: Cannot read properties of null (reading 'length')

[Killed] EqualityOperator
src/middlewares/validateProduct.js:6:7
   if (!name || name === null) {
     return res.status(400).json({ message: '"name" is required' });
   }
-  if (name.length < 5) {
+  if (name.length >= 5) {
     return res.status(422).json({ message: '"name" length must be at least 5 characters long' });
   } 
killedBy: testa middlewares verifica se o middleware está sendo chamado
statusReason: res.status is not a function

[Killed] BlockStatement
src/middlewares/validateProduct.js:6:24
   if (!name || name === null) {
     return res.status(400).json({ message: '"name" is required' });
   }
-  if (name.length < 5) {
-    return res.status(422).json({ message: '"name" length must be at least 5 characters long' });
-  } 
+  if (name.length < 5) {} 
   return next();
 };
killedBy: testa middlewares testa o validateProduct caso o nome tenha menos de 5 caracteres
statusReason: expected stub to have been called with arguments 422
