[Killed] BlockStatement
src/middlewares/validateProductUpdate.js:3:57
 const { productsService } = require('../services');
 
-const validateProductUpdate = async (req, res, next) => {
-  const { id } = req.params;
-  const { name } = req.body;
-  const updated = await productsService.put(id, name);
-  if (!updated) return res.status(404).json({ message: 'Product not found' });
-  return next();
-};
+const validateProductUpdate = async (req, res, next) => {};
 
 module.exports = validateProductUpdate;
killedBy: testa middlewares testa o validateProductUpdate na impossibilidade de atualizar um produto inexistente
statusReason: expected stub to have been called with arguments 404

[Killed] BooleanLiteral
src/middlewares/validateProductUpdate.js:7:7
   const { id } = req.params;
   const { name } = req.body;
   const updated = await productsService.put(id, name);
-  if (!updated) return res.status(404).json({ message: 'Product not found' });
+  if (updated) return res.status(404).json({ message: 'Product not found' });
   return next();
 };
killedBy: testa middlewares testa o validateProductUpdate na impossibilidade de atualizar um produto inexistente
statusReason: expected stub to have been called with arguments 404

[Killed] ConditionalExpression
src/middlewares/validateProductUpdate.js:7:7
   const { id } = req.params;
   const { name } = req.body;
   const updated = await productsService.put(id, name);
-  if (!updated) return res.status(404).json({ message: 'Product not found' });
+  if (false) return res.status(404).json({ message: 'Product not found' });
   return next();
 };
killedBy: testa middlewares testa o validateProductUpdate na impossibilidade de atualizar um produto inexistente
statusReason: expected stub to have been called with arguments 404
