[Killed] BlockStatement
src/middlewares/validateQuantity.js:1:46
-const validateQuantity = (req, res, next) => {
-  const { quantity } = req.body;
-  if (quantity === undefined) {
-    return res.status(400).json({ message: '"quantity" is required' });
-  }
-  if (quantity <= 0) {
-    return res.status(422).json({ message: '"quantity" must be greater than or equal to 1' });
-  }
-  return next();
-};
+const validateQuantity = (req, res, next) => {};
 
 module.exports = validateQuantity;
killedBy: testa middlewares testa erro quando campo quantity não é fornecido
statusReason: expected stub to have been called with arguments 400

[Killed] BlockStatement
src/middlewares/validateQuantity.js:3:31
 const validateQuantity = (req, res, next) => {
   const { quantity } = req.body;
-  if (quantity === undefined) {
-    return res.status(400).json({ message: '"quantity" is required' });
-  }
+  if (quantity === undefined) {}
   if (quantity <= 0) {
     return res.status(422).json({ message: '"quantity" must be greater than or equal to 1' });
killedBy: testa middlewares testa erro quando campo quantity não é fornecido
statusReason: expected stub to have been called with arguments 400

[Killed] ConditionalExpression
src/middlewares/validateQuantity.js:3:7
 const validateQuantity = (req, res, next) => {
   const { quantity } = req.body;
-  if (quantity === undefined) {
+  if (false) {
     return res.status(400).json({ message: '"quantity" is required' });
   }
killedBy: testa middlewares testa erro quando campo quantity não é fornecido
statusReason: expected stub to have been called with arguments 400

[Killed] ConditionalExpression
src/middlewares/validateQuantity.js:6:7
   if (quantity === undefined) {
     return res.status(400).json({ message: '"quantity" is required' });
   }
-  if (quantity <= 0) {
+  if (false) {
     return res.status(422).json({ message: '"quantity" must be greater than or equal to 1' });
   }
killedBy: testa middlewares testa erro quando quantity for menor ou igual 0
statusReason: expected stub to have been called with arguments 422

[Killed] BlockStatement
src/middlewares/validateQuantity.js:6:22
   if (quantity === undefined) {
     return res.status(400).json({ message: '"quantity" is required' });
   }
-  if (quantity <= 0) {
-    return res.status(422).json({ message: '"quantity" must be greater than or equal to 1' });
-  }
+  if (quantity <= 0) {}
   return next();
 };
killedBy: testa middlewares testa erro quando quantity for menor ou igual 0
statusReason: expected stub to have been called with arguments 422
