[Killed] BlockStatement
src/middlewares/validateSale.js:1:42
-const validateSale = (req, res, next) => {
-  const itemsSold = req.body;
-  
-  const productsId = itemsSold.map((product) => product.productId);
-  const productId = productsId.some((id) => id === undefined);
-  if (productId) {
-    return res.status(400).json({ message: '"productId" is required' });
-  }
-  const quantities = itemsSold.map((product) => product.quantity);
-  const quantity = quantities.some((quant) => quant === undefined);
-  if (quantity) {
-    return res.status(400).json({ message: '"quantity" is required' });
-  }
-  next();
-};
+const validateSale = (req, res, next) => {};
 
 module.exports = validateSale;
killedBy: testa middlewares testa impossibilidade de cadastrar venda caso não tenha campo productId
statusReason: expected stub to have been called with arguments 400

[Killed] ConditionalExpression
src/middlewares/validateSale.js:5:45
   const itemsSold = req.body;
   
   const productsId = itemsSold.map((product) => product.productId);
-  const productId = productsId.some((id) => id === undefined);
+  const productId = productsId.some((id) => true);
   if (productId) {
     return res.status(400).json({ message: '"productId" is required' });
killedBy: testa middlewares testa impossibilidade de cadastrar venda caso não tenha campo quantity
statusReason: expected json to have been called with arguments { message: '"quantity" is required' }
{ message: '"productId" is required' } { message: '"quantity" is required' }

[Killed] ConditionalExpression
src/middlewares/validateSale.js:5:45
   const itemsSold = req.body;
   
   const productsId = itemsSold.map((product) => product.productId);
-  const productId = productsId.some((id) => id === undefined);
+  const productId = productsId.some((id) => false);
   if (productId) {
     return res.status(400).json({ message: '"productId" is required' });
killedBy: testa middlewares testa impossibilidade de cadastrar venda caso não tenha campo productId
statusReason: expected stub to have been called with arguments 400

[Killed] BlockStatement
src/middlewares/validateSale.js:6:18
   
   const productsId = itemsSold.map((product) => product.productId);
   const productId = productsId.some((id) => id === undefined);
-  if (productId) {
-    return res.status(400).json({ message: '"productId" is required' });
-  }
+  if (productId) {}
   const quantities = itemsSold.map((product) => product.quantity);
   const quantity = quantities.some((quant) => quant === undefined);
killedBy: testa middlewares testa impossibilidade de cadastrar venda caso não tenha campo productId
statusReason: expected stub to have been called with arguments 400

[Killed] ConditionalExpression
src/middlewares/validateSale.js:6:7
   
   const productsId = itemsSold.map((product) => product.productId);
   const productId = productsId.some((id) => id === undefined);
-  if (productId) {
+  if (false) {
     return res.status(400).json({ message: '"productId" is required' });
   }
killedBy: testa middlewares testa impossibilidade de cadastrar venda caso não tenha campo productId
statusReason: expected stub to have been called with arguments 400

[Killed] ConditionalExpression
src/middlewares/validateSale.js:10:47
     return res.status(400).json({ message: '"productId" is required' });
   }
   const quantities = itemsSold.map((product) => product.quantity);
-  const quantity = quantities.some((quant) => quant === undefined);
+  const quantity = quantities.some((quant) => false);
   if (quantity) {
     return res.status(400).json({ message: '"quantity" is required' });
killedBy: testa middlewares testa impossibilidade de cadastrar venda caso não tenha campo quantity
statusReason: expected stub to have been called with arguments 400

[Killed] EqualityOperator
src/middlewares/validateSale.js:10:47
     return res.status(400).json({ message: '"productId" is required' });
   }
   const quantities = itemsSold.map((product) => product.quantity);
-  const quantity = quantities.some((quant) => quant === undefined);
+  const quantity = quantities.some((quant) => quant !== undefined);
   if (quantity) {
     return res.status(400).json({ message: '"quantity" is required' });
killedBy: testa middlewares testa impossibilidade de cadastrar venda caso não tenha campo quantity
statusReason: expected stub to have been called with arguments 400

[Killed] ConditionalExpression
src/middlewares/validateSale.js:11:7
   }
   const quantities = itemsSold.map((product) => product.quantity);
   const quantity = quantities.some((quant) => quant === undefined);
-  if (quantity) {
+  if (false) {
     return res.status(400).json({ message: '"quantity" is required' });
   }
killedBy: testa middlewares testa impossibilidade de cadastrar venda caso não tenha campo quantity
statusReason: expected stub to have been called with arguments 400

[Killed] BlockStatement
src/middlewares/validateSale.js:11:17
   }
   const quantities = itemsSold.map((product) => product.quantity);
   const quantity = quantities.some((quant) => quant === undefined);
-  if (quantity) {
-    return res.status(400).json({ message: '"quantity" is required' });
-  }
+  if (quantity) {}
   next();
 };
killedBy: testa middlewares testa impossibilidade de cadastrar venda caso não tenha campo quantity
statusReason: expected stub to have been called with arguments 400
