[Killed] BlockStatement
src/models/productsModel.js:3:28
 const connection = require('../database/connection');
 
-const getAll = async () => {
-  const [products] = await connection.execute('SELECT * FROM StoreManager.products ORDER BY id');
-  return products;
-};
+const getAll = async () => {};
 
 const getById = async (id) => {
killedBy: Testa Model de produtos retorna a lista de produtos
statusReason: expected undefined to be an array

[Killed] BlockStatement
src/models/productsModel.js:8:31
   return products;
 };
 
-const getById = async (id) => {
-  const [[product]] = await connection.execute(
-    'SELECT * FROM StoreManager.products WHERE id = ? ORDER BY id',
-    [id],
-  );
-  return product;
-};
+const getById = async (id) => {};
 
 const insert = async (name) => {
killedBy: Testa Model de produtos retorna um produto específico
statusReason: expected undefined to be an object

[Killed] BlockStatement
src/models/productsModel.js:16:32
   return product;
 };
 
-const insert = async (name) => {
-  const [{ insertId }] = await connection.execute(
-    'INSERT INTO StoreManager.products (name) VALUES (?)',
-    [name],
-  );
-  return insertId;
-};
+const insert = async (name) => {};
 
 const put = async (id, name) => {
killedBy: Testa Model de produtos insere um produto específico
statusReason: expected undefined to equal 4

[Killed] BlockStatement
src/models/productsModel.js:24:33
   return insertId;
 };
 
-const put = async (id, name) => {
-  const [update] = await connection.execute(
-    'UPDATE StoreManager.products SET name = ? WHERE id = ?',
-    [name, id],
-  );
-  return update;
-};
+const put = async (id, name) => {};
 
 const deleteId = async (id) => {
killedBy: Testa Model de produtos atualiza um produto
statusReason: expected undefined to be an object

[Killed] BlockStatement
src/models/productsModel.js:32:32
   return update;
 };
 
-const deleteId = async (id) => {
-  const [deleted] = await connection.execute(
-    'DELETE FROM StoreManager.products WHERE id = ?',
-    [id],
-  );
-  return deleted;
-};
+const deleteId = async (id) => {};
 
 module.exports = {
killedBy: Testa Model de produtos deleta um produto
statusReason: expected undefined to be an object
