[Killed] BlockStatement
src/services/validations/validations.js:4:41
 const { productsModel } = require('../../models');
 const { array } = require('./saleSchema');
 
-const validation = async (itemsSold) => {
-  const { error } = await array.validate(itemsSold);
-  if (error) return { type: 'INVALID_DATA', message: error.message };
-
-  const products = await Promise.all(itemsSold
-    .map(async ({ productId }) => productsModel.getById(productId)));
-  const product = products.some((item) => item === undefined);
-  if (product) return { type: 'NOT_FOUND', message: 'Product not found' };
-};
+const validation = async (itemsSold) => {};
 
 module.exports = {
killedBy: Testa Service de sales testa a validação do schema
statusReason: Cannot read properties of undefined (reading 'type')

[Killed] ConditionalExpression
src/services/validations/validations.js:6:7
 
 const validation = async (itemsSold) => {
   const { error } = await array.validate(itemsSold);
-  if (error) return { type: 'INVALID_DATA', message: error.message };
+  if (false) return { type: 'INVALID_DATA', message: error.message };
 
   const products = await Promise.all(itemsSold
killedBy: Testa Service de sales testa a validação do schema
statusReason: Access denied for user ''@'172.18.0.1' (using password: YES)

[Killed] ConditionalExpression
src/services/validations/validations.js:6:7
 
 const validation = async (itemsSold) => {
   const { error } = await array.validate(itemsSold);
-  if (error) return { type: 'INVALID_DATA', message: error.message };
+  if (true) return { type: 'INVALID_DATA', message: error.message };
 
   const products = await Promise.all(itemsSold
killedBy: Testa Service de sales retorna Product not found se não existir campo productId para cadastrar
statusReason: Cannot read properties of null (reading 'message')

[Killed] ConditionalExpression
src/services/validations/validations.js:10:43
 
   const products = await Promise.all(itemsSold
     .map(async ({ productId }) => productsModel.getById(productId)));
-  const product = products.some((item) => item === undefined);
+  const product = products.some((item) => false);
   if (product) return { type: 'NOT_FOUND', message: 'Product not found' };
 };
killedBy: Testa Service de sales retorna Product not found se não existir campo productId para cadastrar
statusReason: Cannot read properties of undefined (reading 'type')

[Killed] EqualityOperator
src/services/validations/validations.js:10:43
 
   const products = await Promise.all(itemsSold
     .map(async ({ productId }) => productsModel.getById(productId)));
-  const product = products.some((item) => item === undefined);
+  const product = products.some((item) => item !== undefined);
   if (product) return { type: 'NOT_FOUND', message: 'Product not found' };
 };
killedBy: Testa Service de sales retorna Product not found se não existir campo productId para cadastrar
statusReason: Cannot read properties of undefined (reading 'type')

[Killed] ConditionalExpression
src/services/validations/validations.js:11:7
   const products = await Promise.all(itemsSold
     .map(async ({ productId }) => productsModel.getById(productId)));
   const product = products.some((item) => item === undefined);
-  if (product) return { type: 'NOT_FOUND', message: 'Product not found' };
+  if (false) return { type: 'NOT_FOUND', message: 'Product not found' };
 };
 
killedBy: Testa Service de sales retorna Product not found se não existir campo productId para cadastrar
statusReason: Cannot read properties of undefined (reading 'type')

[Survived] ConditionalExpression
src/services/validations/validations.js:11:7
   const products = await Promise.all(itemsSold
     .map(async ({ productId }) => productsModel.getById(productId)));
   const product = products.some((item) => item === undefined);
-  if (product) return { type: 'NOT_FOUND', message: 'Product not found' };
+  if (true) return { type: 'NOT_FOUND', message: 'Product not found' };
 };
 
