[Killed] ConditionalExpression
src/utils/mapStatusHTTP.js:11:35
   NO_CONTENT: 204,
 };
 
-const mapStatusHTTP = (status) => httpError[status] || httpError.INTERNAL_ERROR;
+const mapStatusHTTP = (status) => true;
 
 module.exports = mapStatusHTTP;
killedBy: Testa Controller de produtos retorna produtos com sucesso - status 200
statusReason: expected status to have been called with arguments 200
true 200

[Killed] ConditionalExpression
src/utils/mapStatusHTTP.js:11:35
   NO_CONTENT: 204,
 };
 
-const mapStatusHTTP = (status) => httpError[status] || httpError.INTERNAL_ERROR;
+const mapStatusHTTP = (status) => false;
 
 module.exports = mapStatusHTTP;
killedBy: Testa Controller de produtos retorna produtos com sucesso - status 200
statusReason: expected status to have been called with arguments 200
false 200
